app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "updated_at", "house_id", "gender", "spouse_id", "parents_id", "marriage_id", "age", "created_at") VALUES(E'Bobaroonie', '2009-01-19 00:33:11.806246', 1, E'male', NULL, 1, NULL, NULL, '2009-01-19 00:33:11.806246') RETURNING "id"
---
  def create
    @character = Character.new(params[:character])
    @allow_marriage = true
    @allow_offspring = true
    @unmarried_present = true
    @marriages_present = true
    @generic_present = false

    respond_to do |format|
      if @character.save